Revit 2026 API

# RebarContainerItemBaseFinishingTurns Property

---

For a spiral, the number of finishing turns at the lower end of the spiral.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int BaseFinishingTurns { get; set; }
```
```vb
Public Property BaseFinishingTurns As Integer
	Get
	Set
```
```cpp
public:
property int BaseFinishingTurns {
	int get ();
	void set (int value);
}
```
```fsharp
member BaseFinishingTurns : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: turns must be between 0 and 100. |
| InvalidOperationException | This RebarContainerItem is not an instance of a spiral shape. |

Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace